#Dev : @YY8HH

HELP_1 = """
**c** تعني  تشغيل في القناه.
/pause or /cpause • إيقاف تشغيل الموسيقى مؤقتا.
/resume or /cresume • استئناف الموسيقى المتوقفة مؤقتا.
/mute or /cmute • كتم صوت الموسيقى المشغلة.
/unmute or /cunmute • إلغاء كتم صوت الموسيقى الصامتة.
/skip or /cskip • تخطي تشغيل الموسيقى الحالية.
/stop or /cstop- إيقاف تشغيل الموسيقى.
/shuffle or /cshuffle • خلط قائمة التشغيل في قائمة الانتظار عشوائيا.
/seek or /cseek • إعادة توجيه البحث عن الموسيقى إلى المدة الخاصة بك
/seekback or /cseekback • إلى الوراء ابحث عن الموسيقى إلى المدة التي تقضيها
/restart • إعادة تشغيل بوت للدردشة الخاصة بك .
/skip • لتخطي الأغمية الحالية"""

HELP_2 = """
الاوامر المتوفرة = play , vplay , cplay
Force اوامر التشغيل = playforce , vplayforce , cplayforce
**c** اوامر تشغيل في القناه.
**v** لتشغيل   الفيديو.
**force** stands for force play.
/play or /vplay or /cplay  • سيبدأ Bot في تشغيل استعلامك المحدد على الدردشة الصوتية أو بث الروابط المباشرة على الدردشات الصوتية.
/playforce or /vplayforce or /cplayforce •  **يؤدي فرض التشغيل** إلى إيقاف مسار التشغيل الحالي في الدردشة الصوتية وبدء تشغيل المسار الذي تم البحث عنه على الفور دون إزعاج/مسح قائمة الانتظار.
/channelplay [معرف القناه او ايدي القناه] أو [تعطيل] - يمكنك ربط القناة بمجموعة وبث الموسيقى على الدردشة الصوتية للقناة من مجموعتك.
/playlist • تحقق من قائمة التشغيل المحفوظة على الخوادم.
/deleteplaylist • حذف أي موسيقى محفوظة في قائمة التشغيل
/play • ابدء تشغيل قائمة التشغيل المحفوظة من الخوادم."""

HELP_3 = """
/stats • احصل على أفضل 10 مسارات إحصائيات عالمية ، وأفضل 10 مستخدمين للبوت ، وأفضل 10 دردشات على الروبوت ، وأفضل 10 دردشات تم لعبها في دردشة وما إلى ذلك.
/sudolist • تحقق من قائمه المطورين
/lyrics [اسم الموسيقى] • يبحث في كلمات الأغاني عن موسيقى معينة على الويب.
/song [اسم المسار] أو [رابط YT] • قم بتنزيل أي مسار من youtube بتنسيقات mp3 أو mp4.
/player -  احصل على لوحة تشغيل تفاعلية.
/queue or /cqueue • تحقق من قائمة انتظار الموسيقى."""

HELP_4 ="""
/start - بدء تشغيل بوت الموسيقى.
/help  - احصل على قائمة مساعد الاوامــر مع تفسيرات مفصلة للاوامــر.
/ping- بنك بوت والتحقق من ذاكرة الوصول العشوائي، وحدة المعالجة المركزية الخ احصائيات بوت.
/settings • الحصول على إعدادات كاملة للمجموعة باستخدام الأزرار المضمنة
𝟏 يمكنك تعيين ** جودة الصوت ** التي تريد بثها على الدردشة الصوتية.
𝟐 يمكنك تعيين ** جودة الفيديو ** تريد البث على الدردشة الصوتية.
𝟑 ** مصادقة المستخدمين **: - يمكنك تغيير وضع اوامــر المسؤول من هنا إلى الجميع أو المسؤولين فقط. إذا كان الجميع ، فسيتمكن أي شخص موجود في مجموعتك من استخدام اوامــر المسؤول (مثل /skip, /stop، إلخ)
𝟒 ** الوضع النظيف: ** عند تمكينه ، يحذف رسائل الروبوت بعد 5 دقائق من مجموعتك للتأكد من أن الدردشة تظل نظيفة وجيدة.
𝟓 **قيادة نظيفة** : عند تنشيطه، سيقوم بوت بحذف الاوامــر المنفذة (/play, /pause, /shuffle, /stop etc) فورا.
/playmode - احصل على لوحة إعدادات تشغيل كاملة مع أزرار حيث يمكنك تعيين إعدادات تشغيل مجموعتك. 
𝟏 **وضع البحث** [مباشر أو مضمن] • يغير وضع البحث أثناء تقديم /play مود. 
𝟐 **اوامــر المسؤول** [الجميع أو المسؤولون] • إذا كان الجميع، فسيتمكن أي شخص موجود في مجموعتك من استخدام اوامــر المسؤول (مثل /skip, /stop etc)
𝟑 **نوع التشغيل** [الجميع أو المشرفون] • إذا كان المسؤولون ، فيمكن للمسؤولين الموجودين في المجموعة فقط تشغيل الموسيقى على الدردشة الصوتية"""

HELP_5 ="""
/addsudo - اضافة مطور
/delsudo - حذف مطور
-------------------------------
/reboot - إعادة تشغيل البوت
/speedtest - التحقق من سرعة الخادم
/logger [disable | enable] معرفة من يستخدم البوت
-------------------------------
/blacklistchat + معرف القناة او المجموعة لحظرها
/whitelistchat + معرف القناة او المجموعة لرفع حظرها
/blacklistedchat - المجموعات والقنوات المحظورة
-------------------------------
/block + معرف الشخص لحظره
/unblock + معرف الشخص لرفع حظره
/blockedusers - المحظورين
-------------------------------
/gban + معرف الشخص لحظره عام
/ungban + معرف الشخص لالغاء حظره عام
/gbannedusers - المحظورين عام
-------------------------------
`/broadcast -user -assistant -pin + الرسالة لأذاعتها`
-------------------------------
/nobot لايقاف الاذاعة استخدم"""
