#Dev : @YY8HH

HELP_1 = """**وامر ادمن الكروب :**
**c** تعني  تشغيل في القناه.
/pause or /cpause • إيقاف تشغيل الموسيقى مؤقتا.
/resume or /cresume • استئناف الموسيقى المتوقفة مؤقتا.
/mute or /cmute • كتم صوت الموسيقى المشغلة.
/unmute or /cunmute • إلغاء كتم صوت الموسيقى الصامتة.
/skip or /cskip • تخطي تشغيل الموسيقى الحالية.
/stop or /cstop- إيقاف تشغيل الموسيقى.
/shuffle or /cshuffle • خلط قائمة التشغيل في قائمة الانتظار عشوائيا.
/seek or /cseek • إعادة توجيه البحث عن الموسيقى إلى المدة الخاصة بك
/seekback or /cseekback • إلى الوراء ابحث عن الموسيقى إلى المدة التي تقضيها
/restart • إعادة تشغيل بوت للدردشة الخاصة بك .
/skip • لتخطي الأغمية الحالية"""

HELP_2 = """** اوامر التشغيل :**

الاوامر المتوفرة = play , vplay , cplay
Force اوامر التشغيل = playforce , vplayforce , cplayforce
**c** اوامر تشغيل في القناه.
**v** لتشغيل   الفيديو.
**force** stands for force play.
/play or /vplay or /cplay  • سيبدأ Bot في تشغيل استعلامك المحدد على الدردشة الصوتية أو بث الروابط المباشرة على الدردشات الصوتية.
/playforce or /vplayforce or /cplayforce •  **يؤدي فرض التشغيل** إلى إيقاف مسار التشغيل الحالي في الدردشة الصوتية وبدء تشغيل المسار الذي تم البحث عنه على الفور دون إزعاج/مسح قائمة الانتظار.
/channelplay [معرف القناه او ايدي القناه] أو [تعطيل] - يمكنك ربط القناة بمجموعة وبث الموسيقى على الدردشة الصوتية للقناة من مجموعتك.

** قوائم تشغيل البوت :**
/playlist • تحقق من قائمة التشغيل المحفوظة على الخوادم.
/deleteplaylist • حذف أي موسيقى محفوظة في قائمة التشغيل
/play • ابدء تشغيل قائمة التشغيل المحفوظة من الخوادم."""

HELP_3 = """**اوامر البوت :**

/stats • احصل على أفضل 10 مسارات إحصائيات عالمية ، وأفضل 10 مستخدمين للبوت ، وأفضل 10 دردشات على الروبوت ، وأفضل 10 دردشات تم لعبها في دردشة وما إلى ذلك.
/sudolist • تحقق من قائمه المطورين
/lyrics [اسم الموسيقى] • يبحث في كلمات الأغاني عن موسيقى معينة على الويب.
/song [اسم المسار] أو [رابط YT] • قم بتنزيل أي مسار من youtube بتنسيقات mp3 أو mp4.
/player -  احصل على لوحة تشغيل تفاعلية.
/queue or /cqueue • تحقق من قائمة انتظار الموسيقى."""

HELP_4 = """** اوامر اضافية :**

/start - بدء تشغيل بوت الموسيقى.
/help  - احصل على قائمة مساعد الاوامــر مع تفسيرات مفصلة للاوامــر.
/ping- بنك بوت والتحقق من ذاكرة الوصول العشوائي، وحدة المعالجة المركزية الخ احصائيات بوت.
**اعدادات المجموعة :**
/settings • الحصول على إعدادات كاملة للمجموعة باستخدام الأزرار المضمنة"""

HELP_5 = """**اوامر المطورين :**

/addsudo [معرف المستخدم] - اضافة مطور
/delsudo [معرف المستخدم] - حذف مطور
/sudolist - قائمة المطورين
** اوامر البوت :**
/reboot - إعادة تشغيل البوت
/update - تحديث البوت.
/speedtest - التحقق من سرعة الخادم
/logger [disable | enable] معرفة من يستخدم البوت
** اوامر الاحصائيات :**
/activevoice - تحقق من الدردشات الصوتية النشطة
** اوامر الحظر :**
/blacklistchat [معرف القناة او المجموعة] - القائمة السوداء لأي دردشة
/whitelistchat [معرف القناه او المجموعة] - القائمة البيضاء لأي دردشة
/blacklistedchat - التحقق من جميع الدردشات الحظورة
**اوامر حظر الاشخاص :**
/block [معرف الحساب] - حظر
/unblock [معرف الحساب] - رفع الحظر 
/blockedusers - المحظورين
**اوامر الحظر العام :**
/gban [معرف الحساب] - حظر عام
/ungban [معرف الحساب] - الغاء حظر عام
/gbannedusers - المحظورين عام
**وظيقة البوت الخاصة :**
/authorize [معرف القناه] - حظر قناة
/unauthorize [معرف القناه] - الغاء حظر قناة
/authorized - القنوات المحظورة
**وظيفة الاذاعة :**
/broadcast [رسالة أو الرد على رسالة]
*خيارات الاذاعة :**"
**-pin** :  تثبيت رسالة البث
**-pinloud** : تثبيت الرسالة بأشعار عالٍ
**-user** : بث للمستخدمين
**-assistant** : بث من المساعد
**-nobot** : ايقاف البث
**مثال :** `/broadcast -user  -assistant -pin مرحبا`"""
